In [3]:
import pandas as pd

In [15]:
data=pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],'Age': [25, 30, 35, 40, 45],'Department': ['HR', 'IT', 'Finance', 'Marketing', 'Operations']})

In [16]:
data

      Name  Age  Department
0    Alice   25          HR
1      Bob   30          IT
2  Charlie   35     Finance
3    David   40   Marketing
4      Eve   45  Operations

In [17]:
#Question 1
data.Name

0      Alice
1        Bob
2    Charlie
3      David
4        Eve
Name: Name, dtype: object

In [18]:
#Question 2
data.loc[data['Age']>30,:]

      Name  Age  Department
2  Charlie   35     Finance
3    David   40   Marketing
4      Eve   45  Operations

In [20]:
#Question 3
data.iloc[2]

Name          Charlie
Age                35
Department    Finance
Name: 2, dtype: object

In [25]:
#Question 4
data.iloc[:3,:2]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [26]:
#Question 5
data.loc[3,['Age']]=42
data

      Name  Age  Department
0    Alice   25          HR
1      Bob   30          IT
2  Charlie   35     Finance
3    David   42   Marketing
4      Eve   45  Operations

In [34]:
#Question 6
data.loc[data['Department']=='IT','Department']='Tech Support'
data

      Name  Age    Department
0    Alice   25         Admin
1      Bob   32  Tech Support
2  Charlie   35       Finance
3    David   42     Marketing
4      Eve   45    Operations

In [30]:
#Question 7
data.iloc[1,1]=32
data

      Name  Age  Department
0    Alice   25          HR
1      Bob   32          IT
2  Charlie   35     Finance
3    David   42   Marketing
4      Eve   45  Operations

In [32]:
#Question 8
data.iloc[0,2]='Admin'
data

      Name  Age  Department
0    Alice   25       Admin
1      Bob   32          IT
2  Charlie   35     Finance
3    David   42   Marketing
4      Eve   45  Operations